function sendEmail() {
    console.log("function called");
    const recipients = [
    "cp-ahd@gujarat.gov.in"
];

    const subject = `अहमदाबाद के सेवेंथ डे स्कूल की घटना के बाद, 
स्कूल में तोड़फोड़ करने वाले तत्वों और पैगंबर हजरत मोहम्मद साहब के खिलाफ 
अभद्र टिप्पणी करने वालों तथा बैठक के दौरान तलवारें लहराने वालों के खिलाफ सख्त कार्रवाई की जाए।`;


    const body = `सेवा में, 
माननीय पुलिस महानिदेशक (डीजीपी), गुजरात राज्य, गांधीनगर।

माननीय पुलिस आयुक्त, अहमदाबाद शहर।

विषय:

अहमदाबाद के सेवेंथ डे स्कूल की घटना के बाद, स्कूल में तोड़फोड़ करने वाले तत्वों और पैगंबर हजरत मोहम्मद साहब के खिलाफ अभद्र टिप्पणी करने वालों तथा बैठक के दौरान तलवारें लहराने वालों के खिलाफ सख्त कार्रवाई की जाए।

महोदय,

अहमदाबाद के सेवेंथ डे स्कूल में 19/08/2025 को हुई दुखद घटना के बाद, कुछ असामाजिक तत्वों ने स्कूल परिसर में घुसकर तोड़फोड़ की, शिक्षकों-प्रधानाचार्यों पर हमला किया और सामाजिक भेदभाव पैदा करने की कोशिश की।

इसके अलावा, इस घटना के संबंध में एक बैठक आयोजित की गई जिसमें विश्व हिंदू परिषद के नेता धर्मेंद्र भवानी ने पैगंबर हजरत मोहम्मद साहब के खिलाफ अभद्र टिप्पणी की।और वहाँ मौजूद लोगों ने सरेआम तलवारें लहराईं। इसका वीडियो अब सोशल मीडिया पर वायरल हो गया है, जिससे मुस्लिम समुदाय समेत पूरे सभ्य समाज की धार्मिक भावनाएँ आहत हुई हैं और समाज में कानून-व्यवस्था भंग होने का खतरा पैदा हो गया है।

ऐसा व्यवहार न केवल कानून के विरुद्ध है, बल्कि भारतीय दंड संहिता और शस्त्र अधिनियम की गंभीर धाराओं के तहत अपराध भी बनता है, जिनमें शामिल हैं:


धार्मिक भावनाओं को ठेस पहुँचाना,
दंगे फैलाने का प्रयास करना,

समाज में घृणा का माहौल बनाना,

हथियारों से धमकाना,

स्पष्ट रूप से दंडनीय अपराध हैं।

अतः आपसे अनुरोध है कि:

1. उपरोक्त सभा में हज़रत मोहम्मद साहब (सल्लल्लाहो अलैहि व सल्लम) के विरुद्ध आपत्तिजनक भाषण और अपमानजनक टिप्पणियाँ करने वाले धर्मेंद्र भवानी और अन्य तत्वों के विरुद्ध आपराधिक मामला दर्ज करें।

2. सार्वजनिक रूप से तलवारें लहराने वालों की पहचान करें और उनके विरुद्ध शस्त्र अधिनियम और बीएनएस की लागू धाराओं के अंतर्गत मामला दर्ज करें।
3. ऐसे भड़काऊ और गैरकानूनी कृत्यों के ज़रिए समाज में दंगे/अशांति फैलाने की कोशिश करने वालों के ख़िलाफ़ कड़ी कार्रवाई करके मिसाल कायम करें।

4. स्कूल, शिक्षकों और छात्रों की सुरक्षा सुनिश्चित करने के लिए तत्काल कदम उठाएँ।

👉 यह व्यवहार न केवल क़ानूनी अपराध है, बल्कि समाज की शांति, सद्भाव और धार्मिक भावनाओं पर सीधा प्रहार है।

हम माँग करते हैं कि सेवेंथ डे स्कूल की घटना से जुड़े सभी असामाजिक तत्वों, साथ ही हज़रत मुहम्मद साहब (PBUH) के ख़िलाफ़ अपमानजनक टिप्पणी करने वाले धर्मेंद्र भवानी और सभा में साम्प्रदायिक ज़हर फैलाने और हथियारों से धमकी देने वालों को क़ानून की पूरी सख़्त सज़ा दी जाए।

सादर
https://drive.google.com/file/d/16tAOdwCdwAud6cR0bZlgOH4yrpo71kGX/view?usp=sharing
`.trim();

    const to = recipients.join(",");
    const mailtoLink = `mailto:${to}?subject=${encodeURIComponent(subject)}&body=${encodeURIComponent(body)}`;
    window.location.href = mailtoLink;
//     const mailtoLink = `https://mail.google.com/mail/?view=cm&fs=1&to=${to}&su=${encodeURIComponent(subject)}&body=${encodeURIComponent(body)}`;
// window.open(mailtoLink, "_blank");

}







